In [36]:
# timestamp (실수형태)->str  
import time
print(time.time())
type(time.time())

timestamp= time.time()
s=str(timestamp)
print(s, type(s))

1626763207.1809597
1626763207.1809597 <class 'str'>

In [37]:
# datetime (팬더스에서는 이거 자체를 timestamp로 본다..?) -> str
from datetime import datetime
s= datetime.now()
print(s,type(s))

s1= datetime.now().strftime('%Y-%m-%d %H:%M:%S') #str+ format+time
print(s1,type(s1))

2021-07-20 15:40:07.595120 <class 'datetime.datetime'>
2021-07-20 15:40:07 <class 'str'>

In [38]:
# str-> datetime
from datetime import datetime
s= '2021-07-20 11:14:03'

datetime.strptime(s,'%Y-%m-%d %H:%M:%S') # str+ pasing+time

datetime.datetime(2021, 7, 20, 11, 14, 3)

In [39]:
# str-> timestamp
s= '2021-07-20 11:14:03'
timestamp= time.mktime(datetime.strptime(s,'%Y-%m-%d %H:%M:%S').timetuple())
print(timestamp,type(timestamp))

1626747243.0 <class 'float'>

In [40]:
# datetime -> timestamp
datetime.today()
timestamp= time.mktime(datetime.today().timetuple())
print(timestamp,type(timestamp))

1626763208.0 <class 'float'>

In [41]:
# timestamp-> datetime
t= time.time()
# print(t)
d= datetime.fromtimestamp(t)
print(d,type(d))

2021-07-20 15:40:09.115853 <class 'datetime.datetime'>

In [42]:
# 판다스 to_datetime'
import pandas as pd
pd.to_datetime(1626751327.858941,unit='s')

Timestamp('2021-07-20 03:22:07.858941184')

In [43]:
# 1년전 datetime 값
from datetime import timedelta
import time

datetime_now= datetime.now()
delta_datetime= timedelta(days=-365)
print(delta_datetime)
datetime_now+delta_datetime

-365 days, 0:00:00

datetime.datetime(2020, 7, 20, 15, 40, 12, 434267)

In [44]:
# 두 날짜간의 일수 구하기 
since_timestamp= datetime.strptime('20180301','%Y%m%d')
until_timestamp= datetime.strptime('20180331','%Y%m%d')
result= until_timestamp - since_timestamp
result

datetime.timedelta(days=30)

In [45]:
# 특정일 구하기 
import datetime
def get_yoil(y,m,d):
    days=['MON','TUE','WED','THU','FRI','SAT','SUN']
    return days[datetime.date(y,m,d).weekday()] #요일 인덱스 나옴

get_yoil(2021,7,20)

'TUE'

In [46]:
import pandas as pd
date= pd.Timestamp(1626747931.0,unit='s',tz='Asia/Seoul')
print(date,type(date))

2021-07-20 11:25:31+09:00 <class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [47]:
df= pd.read_csv('dataset/stock-data.csv')
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [49]:
df = pd.read_csv('dataset/stock-data.csv')
df.head()

df['New_Date'] = pd.to_datetime(df['Date'])
df.info()

df.drop('Date',axis=1, inplace = True)

df['year'] = df['New_Date'].dt.year
df['month'] = df['New_Date'].dt.month
df['day'] = df['New_Date'].dt.day
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   New_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

   Close  Start   High    Low  Volume   New_Date  year  month  day
0  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  10800  10900  11000  10700   63039 2018-06-26  2018      6   26

In [53]:
df.set_index('New_Date',inplace=True)
df.head()

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-07-02  10100  10850  10900  10000  137977  2018      7    2
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [54]:
df.index

DatetimeIndex(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27',
               '2018-06-26', '2018-06-25', '2018-06-22', '2018-06-21',
               '2018-06-20', '2018-06-19', '2018-06-18', '2018-06-15',
               '2018-06-14', '2018-06-12', '2018-06-11', '2018-06-08',
               '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
              dtype='datetime64[ns]', name='New_Date', freq=None)

In [55]:
df_ymd_range = df['2018-06-29':'2018-06-26']
df_ymd_range

            Close  Start   High    Low  Volume  year  month  day
New_Date
2018-06-29  10700  10550  10900   9990  170253  2018      6   29
2018-06-28  10400  10900  10950  10150  155769  2018      6   28
2018-06-27  10900  10800  11050  10500  133548  2018      6   27
2018-06-26  10800  10900  11000  10700   63039  2018      6   26

In [56]:
df_ym= df.loc['2018-07','Start':'High']
df_ym

            Start   High
New_Date
2018-07-02  10850  10900

In [18]:
# Time Series Basics
import numpy as np
import pandas as pd
from datetime import datetime

dates= [datetime(2011,1,2),datetime(2011,1,5),
        datetime(2011,1,7),datetime(2011,1,8),
        datetime(2011,1,10),datetime(2011,1,12)]

ts= pd.Series(np.random.randn(6),index=dates)
ts
#randn = random으로 뽑아주는데 ㄱ정규분포된 난수

2011-01-02   -1.143188
2011-01-05   -0.115854
2011-01-07   -0.623304
2011-01-08   -0.937012
2011-01-10    1.689960
2011-01-12    0.234855
dtype: float64

In [19]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12'],
              dtype='datetime64[ns]', freq=None)

In [20]:
ts[::2]

2011-01-02   -1.143188
2011-01-07   -0.623304
2011-01-10    1.689960
dtype: float64

In [21]:
ts + ts[::2]

2011-01-02   -2.286377
2011-01-05         NaN
2011-01-07   -1.246608
2011-01-08         NaN
2011-01-10    3.379920
2011-01-12         NaN
dtype: float64

In [22]:
# ts.add(ts[::2], fill_value=0

In [23]:
ts.index[0]

Timestamp('2011-01-02 00:00:00')

In [24]:
# indexing, Selection, Subsetting
stamp= ts.index[2]
ts[stamp]

-0.6233041400553238

In [25]:
#2011-01-10 1.089753
print(ts['1/10/2011'])
ts['20110110']

1.689959926022236

1.689959926022236

In [26]:
longer_ts= pd.Series(np.random.randn(1000),
                    index= pd.date_range('1,1,2000',periods=1000))
print(longer_ts, '\s')

2000-01-01   -0.007814
2000-01-02   -0.350170
2000-01-03    0.273786
2000-01-04    0.136688
2000-01-05   -2.105517
                ...
2002-09-22    0.395659
2002-09-23   -1.264316
2002-09-24    0.605645
2002-09-25   -0.507103
2002-09-26    0.186946
Freq: D, Length: 1000, dtype: float64 \s

In [27]:
longer_ts['2001-05'][:5]  # 5월달만 5개보기

2001-05-01   -0.314949
2001-05-02    0.431998
2001-05-03   -1.543668
2001-05-04    0.267460
2001-05-05   -0.945444
Freq: D, dtype: float64

In [28]:
ts

2011-01-02   -1.143188
2011-01-05   -0.115854
2011-01-07   -0.623304
2011-01-08   -0.937012
2011-01-10    1.689960
2011-01-12    0.234855
dtype: float64

In [29]:
ts[datetime(2011,1,7):]

2011-01-07   -0.623304
2011-01-08   -0.937012
2011-01-10    1.689960
2011-01-12    0.234855
dtype: float64

In [30]:
# truncate
print(ts.truncate(before='2011-01-05',after='2011-01-07'))

2011-01-05   -0.115854
2011-01-07   -0.623304
dtype: float64

In [31]:
print(ts.truncate(after='1/9/2011'))

2011-01-02   -1.143188
2011-01-05   -0.115854
2011-01-07   -0.623304
2011-01-08   -0.937012
dtype: float64

In [32]:
pd.date_range('2020-10-7','2020-10-20')

DatetimeIndex(['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10',
               '2020-10-11', '2020-10-12', '2020-10-13', '2020-10-14',
               '2020-10-15', '2020-10-16', '2020-10-17', '2020-10-18',
               '2020-10-19', '2020-10-20'],
              dtype='datetime64[ns]', freq='D')

In [57]:
# https://predictors.tistory.com/26
# 시계열정리함수

In [58]:
from datetime import datetime
from datetime import timedelta

now= datetime.now()
in_two_weeks= now+timedelta(weeks=2)
pd.date_range(datetime.now(),in_two_weeks)

DatetimeIndex(['2021-07-20 15:42:04.851021', '2021-07-21 15:42:04.851021',
               '2021-07-22 15:42:04.851021', '2021-07-23 15:42:04.851021',
               '2021-07-24 15:42:04.851021', '2021-07-25 15:42:04.851021',
               '2021-07-26 15:42:04.851021', '2021-07-27 15:42:04.851021',
               '2021-07-28 15:42:04.851021', '2021-07-29 15:42:04.851021',
               '2021-07-30 15:42:04.851021', '2021-07-31 15:42:04.851021',
               '2021-08-01 15:42:04.851021', '2021-08-02 15:42:04.851021',
               '2021-08-03 15:42:04.851021'],
              dtype='datetime64[ns]', freq='D')

In [59]:
pd.date_range(start='2020-10-01',end='2020-10-20',periods=5)

# 5개로 나눠줌

DatetimeIndex(['2020-10-01 00:00:00', '2020-10-05 18:00:00',
               '2020-10-10 12:00:00', '2020-10-15 06:00:00',
               '2020-10-20 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [60]:
pd.date_range('2012-05-02 12:56:31', periods=5)

DatetimeIndex(['2012-05-02 12:56:31', '2012-05-03 12:56:31',
               '2012-05-04 12:56:31', '2012-05-05 12:56:31',
               '2012-05-06 12:56:31'],
              dtype='datetime64[ns]', freq='D')

In [61]:
pd.date_range('2012-05-02 12:56:31', periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')


#### freq 매개변수에 사용되는 Frequncy strings

- A calendar year end frequency
- B business day frequency
- C custom business day frequency
- D calendar day frequency
- W weekly frequency
- M month end frequency
- SM semi-month end frequency (15th and end of month)
- BM business month end frequency
- CBM custom business month end frequency
- MS month start frequency
- SMS semi-month start frequency (1st and 15th)
- BMS business month start frequency
- CBMS custom business month start frequency
- Q quarter end frequency

In [62]:
import numpy as np
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED')
print(dates)

DatetimeIndex(['2000-01-05', '2000-01-12', '2000-01-19', '2000-01-26',
               '2000-02-02', '2000-02-09', '2000-02-16', '2000-02-23',
               '2000-03-01', '2000-03-08', '2000-03-15', '2000-03-22',
               '2000-03-29', '2000-04-05', '2000-04-12', '2000-04-19',
               '2000-04-26', '2000-05-03', '2000-05-10', '2000-05-17',
               '2000-05-24', '2000-05-31', '2000-06-07', '2000-06-14',
               '2000-06-21', '2000-06-28', '2000-07-05', '2000-07-12',
               '2000-07-19', '2000-07-26', '2000-08-02', '2000-08-09',
               '2000-08-16', '2000-08-23', '2000-08-30', '2000-09-06',
               '2000-09-13', '2000-09-20', '2000-09-27', '2000-10-04',
               '2000-10-11', '2000-10-18', '2000-10-25', '2000-11-01',
               '2000-11-08', '2000-11-15', '2000-11-22', '2000-11-29',
               '2000-12-06', '2000-12-13', '2000-12-20', '2000-12-27',
               '2001-01-03', '2001-01-10', '2001-01-17', '2001-01-24',
               '2001-01-31', '2001-02-07', '2001-02-14', '2001-02-21',
               '2001-02-28', '2001-03-07', '2001-03-14', '2001-03-21',
               '2001-03-28', '2001-04-04', '2001-04-11', '2001-04-18',
               '2001-04-25', '2001-05-02', '2001-05-09', '2001-05-16',
               '2001-05-23', '2001-05-30', '2001-06-06', '2001-06-13',
               '2001-06-20', '2001-06-27', '2001-07-04', '2001-07-11',
               '2001-07-18', '2001-07-25', '2001-08-01', '2001-08-08',
               '2001-08-15', '2001-08-22', '2001-08-29', '2001-09-05',
               '2001-09-12', '2001-09-19', '2001-09-26', '2001-10-03',
               '2001-10-10', '2001-10-17', '2001-10-24', '2001-10-31',
               '2001-11-07', '2001-11-14', '2001-11-21', '2001-11-28'],
              dtype='datetime64[ns]', freq='W-WED')

In [63]:
long_df = pd.DataFrame(np.random.randn(100,4),
                      index=dates,
                      columns = ['Colorado','Texas','New York','Ohio'])
print(long_df,'\n')
long_df.loc['2001-06']

            Colorado     Texas  New York      Ohio
2000-01-05 -0.164350 -0.664329  1.734287 -1.498042
2000-01-12  0.057408 -0.892399  0.729815 -0.641548
2000-01-19  1.904909 -1.106797 -0.327331 -0.805298
2000-01-26 -0.516025 -1.445716  0.213282  1.426455
2000-02-02 -0.134503 -0.820203 -0.432401  0.299924
...              ...       ...       ...       ...
2001-10-31 -0.127518  1.111369 -0.259781  1.033879
2001-11-07  0.446418  1.059347 -1.263386  1.565665
2001-11-14 -0.503258  0.655157 -1.695943  0.497882
2001-11-21 -1.922283 -0.084493 -1.522146  2.263210
2001-11-28 -0.770483 -1.365265  1.379640 -1.684780

[100 rows x 4 columns]

            Colorado     Texas  New York      Ohio
2001-06-06  0.315255 -1.614301  0.377826  1.919619
2001-06-13  0.381192 -0.547781 -0.145514 -1.036025
2001-06-20 -0.342949 -0.130475 -1.332893  0.919872
2001-06-27  0.680724  0.739772  0.450301  0.180291

In [64]:
dates = pd.DatetimeIndex(['1/1/2000','1/2/2000','1/2/2000','1/2/2000',
                         '1/3/2000'])
dup_ts = pd.Series(np.arange(5),index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [65]:
dup_ts.index.is_unique

False

In [66]:
dup_ts['1/3/2000'] # not duplicated의 경우 스칼라 값

4

In [67]:
dup_ts['1/2/2000'] # duplicated의 경우 슬라이스 출력

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int32

In [68]:
grouped = dup_ts.groupby(level=0)
print(grouped.mean())
grouped.count()

2000-01-01    0
2000-01-02    2
2000-01-03    4
dtype: int32

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

In [69]:
pd.date_range('2000-01-01','2000-01-03 23:59',freq='4h')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [70]:
from pandas.tseries.offsets import Hour, Minute
Hour(2) + Minute(30)

In [71]:
pd.date_range('2000-01-01', periods=10, freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

In [72]:
rng = pd.date_range('2000-01-01','2012-09-01',freq='WOM-3FRI')
print(rng)

DatetimeIndex(['2000-01-21', '2000-02-18', '2000-03-17', '2000-04-21',
               '2000-05-19', '2000-06-16', '2000-07-21', '2000-08-18',
               '2000-09-15', '2000-10-20',
               ...
               '2011-11-18', '2011-12-16', '2012-01-20', '2012-02-17',
               '2012-03-16', '2012-04-20', '2012-05-18', '2012-06-15',
               '2012-07-20', '2012-08-17'],
              dtype='datetime64[ns]', length=152, freq='WOM-3FRI')

In [73]:

from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [74]:
offset = MonthEnd()
print(offset.rollforward(now))
offset.rollback(now)

2011-11-30 00:00:00

Timestamp('2011-10-31 00:00:00')

In [75]:
ts = pd.Series(np.random.randn(20),
               index=pd.date_range('1/15/2000', periods=20, freq='4d'))
print(ts)

2000-01-15    1.298773
2000-01-19    0.117744
2000-01-23   -0.412305
2000-01-27    0.385500
2000-01-31   -1.156918
2000-02-04    0.152086
2000-02-08   -0.243148
2000-02-12   -0.189473
2000-02-16    0.667248
2000-02-20    0.676307
2000-02-24   -1.816267
2000-02-28    0.754990
2000-03-03    0.297167
2000-03-07   -0.137461
2000-03-11    0.345679
2000-03-15   -0.261095
2000-03-19   -0.631596
2000-03-23   -0.787105
2000-03-27   -1.425724
2000-03-31   -1.177539
Freq: 4D, dtype: float64

In [76]:
# 과제
# Q. offset.rollforward 기준으로 그룹화를 진행 후 그룹별 평균값을 출력하세요.

In [77]:
# 과제
# Q. 상기 문제를 resample을 사용하여 수행하세요.

In [ ]:
# 과제
# Q. 날짜 데이터를 인덱스로 하는 5가지 이상의 컬럼을 포함하고 있는 데이터 셋을 
# 생성하세요.단 각 컬럼은 인덱스별 의미있는 값을 갖도록 만든 후 다음을 수행하세요
# - 특정 연별, 월별, 일별 특정 컬럼 값 집계
# - 인덱스를 실수형으로 변환 후 다시 datetiem으로 변환
# - 인덱스의 포멧을 변환

In [2]:
import pandas as pd

In [6]:
# 기간을 타임스탬프로 변환 
import numpy as np
rng=pd.period_range('2000-01-01',periods=3,freq='M')
ts= pd.Series(np.random.randn(3),index=rng)
print(ts,'\n')
ts.to_timestamp(how='end')

2000-01   -0.642201
2000-02   -0.175366
2000-03   -0.547416
Freq: M, dtype: float64

2000-01-31 23:59:59.999999999   -0.642201
2000-02-29 23:59:59.999999999   -0.175366
2000-03-31 23:59:59.999999999   -0.547416
dtype: float64

In [7]:
# downsampling 
rng= pd.date_range('2001-01-01',periods=12, freq='T') # 초단위 
ts= pd.Series(np.arange(12),index=rng)
ts

2001-01-01 00:00:00     0
2001-01-01 00:01:00     1
2001-01-01 00:02:00     2
2001-01-01 00:03:00     3
2001-01-01 00:04:00     4
2001-01-01 00:05:00     5
2001-01-01 00:06:00     6
2001-01-01 00:07:00     7
2001-01-01 00:08:00     8
2001-01-01 00:09:00     9
2001-01-01 00:10:00    10
2001-01-01 00:11:00    11
Freq: T, dtype: int32

In [9]:
ts.resample('5min',closed='right').sum()

2000-12-31 23:55:00     0
2001-01-01 00:00:00    15
2001-01-01 00:05:00    40
2001-01-01 00:10:00    11
Freq: 5T, dtype: int32

In [11]:
ts.resample('5min').ohlc()

                     open  high  low  close
2001-01-01 00:00:00     0     4    0      4
2001-01-01 00:05:00     5     9    5      9
2001-01-01 00:10:00    10    11   10     11

In [12]:
frame= pd.DataFrame(np.random.randn(2,4),
                   index=pd.date_range('1/1/2000',periods=2,
                                      freq='W-WED'),
                   columns=['Colorado','Texas','New York','Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05  0.379783  0.930056  1.311844  0.104877
2000-01-12  0.249254 -0.166915 -0.662113 -1.473104

In [13]:
df_daily= frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05  0.379783  0.930056  1.311844  0.104877
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.249254 -0.166915 -0.662113 -1.473104

In [14]:
frame.resample('D').ffill() # 앞에꺼로 다 채우기

            Colorado     Texas  New York      Ohio
2000-01-05  0.379783  0.930056  1.311844  0.104877
2000-01-06  0.379783  0.930056  1.311844  0.104877
2000-01-07  0.379783  0.930056  1.311844  0.104877
2000-01-08  0.379783  0.930056  1.311844  0.104877
2000-01-09  0.379783  0.930056  1.311844  0.104877
2000-01-10  0.379783  0.930056  1.311844  0.104877
2000-01-11  0.379783  0.930056  1.311844  0.104877
2000-01-12  0.249254 -0.166915 -0.662113 -1.473104

In [15]:
frame.resample('D').ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05  0.379783  0.930056  1.311844  0.104877
2000-01-06  0.379783  0.930056  1.311844  0.104877
2000-01-07  0.379783  0.930056  1.311844  0.104877
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.249254 -0.166915 -0.662113 -1.473104